MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FN1M0VMD12/mcu.h
#define EWM_CTRL                      (*((volatile uint32_t *)0x40061000))      // Control Register (EWM_CTRL)
#define EWM_SERV                      (*((volatile uint32_t *)0x40061001))      // Service Register (EWM_SERV)
#define EWM_CMPL                      (*((volatile uint32_t *)0x40061002))      // Compare Low Register (EWM_CMPL)
#define EWM_CMPH                      (*((volatile uint32_t *)0x40061003))      // Compare High Register (EWM_CMPH)


//*****************************************************************************
//
// Watchdog Timer (WDOG) registers
//
//*****************************************************************************

#define WDOG_STCTRLH                  (*((volatile uint32_t *)0x40052000))      // Watchdog Status and Control Register High
#define WDOG_STCTRLL                  (*((volatile uint32_t *)0x40052002))      // Watchdog Status and Control Register Low
#define WDOG_TOVALH                   (*((volatile uint32_t *)0x40052004))      // Watchdog Time-out Value Register High
#define WDOG_TOVALL                   (*((volatile uint32_t *)0x40052006))      // Watchdog Time-out Value Register Low
#define WDOG_WINH                     (*((volatile uint32_t *)0x40052008))      // Watchdog Window Register High
#define WDOG_WINL                     (*((volatile uint32_t *)0x4005200A))      // Watchdog Window Register Low
#define WDOG_REFRESH                  (*((volatile uint32_t *)0x4005200C))      // Watchdog Refresh register
#define WDOG_UNLOCK                   (*((volatile uint32_t *)0x4005200E))      // Watchdog Unlock register
#define WDOG_TMROUTH                  (*((volatile uint32_t *)0x40052010))      // Watchdog Timer Output Register High
#define WDOG_TMROUTL                  (*((volatile uint32_t *)0x40052012))      // Watchdog Timer Output Register Low
#define WDOG_RSTCNT                   (*((volatile uint32_t *)0x40052014))      // Watchdog Reset Count register
#define WDOG_PRESC                    (*((volatile uint32_t *)0x40052016))      // Watchdog Prescaler register


//*****************************************************************************
//
// Multipurpose Clock Generator (MCG) registers
//
//*****************************************************************************

#define MCG_C1                        (*((volatile uint32_t *)0x40064000))      // MCG Control 1 Register
#define MCG_C2                        (*((volatile uint32_t *)0x40064001))      // MCG Control 2 Register
#define MCG_C3                        (*((volatile uint32_t *)0x40064002))      // MCG Control 3 Register
#define MCG_C4                        (*((volatile uint32_t *)0x40064003))      // MCG Control 4 Register
#define MCG_C5                        (*((volatile uint32_t *)0x40064004))      // MCG Control 5 Register
#define MCG_C6                        (*((volatile uint32_t *)0x40064005))      // MCG Control 6 Register
#define MCG_S                         (*((volatile uint32_t *)0x40064006))      // MCG Status Register
#define MCG_SC                        (*((volatile uint32_t *)0x40064008))      // MCG Status and Control Register
#define MCG_ATCVH                     (*((volatile uint32_t *)0x4006400A))      // MCG Auto Trim Compare Value High Register
#define MCG_ATCVL                     (*((volatile uint32_t *)0x4006400B))      // MCG Auto Trim Compare Value Low Register
#define MCG_C7                        (*((volatile uint32_t *)0x4006400C))      // MCG Control 7 Register
#define MCG_C8                        (*((volatile uint32_t *)0x4006400D))      // MCG Control 8 Register
#define MCG_C10                       (*((volatile uint32_t *)0x4006400F))      // MCG Control 10 Register
#define MCG_C11                       (*((volatile uint32_t *)0x40064010))      // MCG Control 11 Register
#define MCG_C12                       (*((volatile uint32_t *)0x40064011))      // MCG Control 12 Register
#define MCG_S2                        (*((volatile uint32_t *)0x40064012))      // MCG Status 2 Register


//*****************************************************************************
//
// Oscillator (OSC) registers
//
//*****************************************************************************

#define OSC0_CR                       (*((volatile uint32_t *)0x40065000))      // OSC Control Register (OSC0_CR)
#define OSC1_CR                       (*((volatile uint32_t *)0x400E5000))      // OSC Control Register (OSC1_CR)


//*****************************************************************************
//
// Local Memory Controller registers
//
//*****************************************************************************

#define LMEM_PCCCR                    (*((volatile uint32_t *)0xE0082000))      // Cache control register (LMEM_PCCCR)
#define LMEM_PCCLCR                   (*((volatile uint32_t *)0xE0082004))      // Cache line control register (LMEM_PCCLCR)
#define LMEM_PCCSAR                   (*((volatile uint32_t *)0xE0082008))      // Cache search address register (LMEM_PCCSAR)
#define LMEM_PCCCVR                   (*((volatile uint32_t *)0xE008200C))      // Cache read/write value register (LMEM_PCCCVR)
#define LMEM_PCCRMR                   (*((volatile uint32_t *)0xE0082020))      // Cache regions mode register (LMEM_PCCRMR)
#define LMEM_PSCCR                    (*((volatile uint32_t *)0xE0082800))      // Cache control register (LMEM_PSCCR)
#define LMEM_PSCLCR                   (*((volatile uint32_t *)0xE0082804))      // Cache line control register (LMEM_PSCLCR)
#define LMEM_PSCSAR                   (*((volatile uint32_t *)0xE0082808))      // Cache search address register (LMEM_PSCSAR)
#define LMEM_PSCCVR                   (*((volatile uint32_t *)0xE008280C))      // Cache read/write value register (LMEM_PSCCVR)
#define LMEM_PSCRMR                   (*((volatile uint32_t *)0xE0082820))      // Cache regions mode register (LMEM_PSCRMR)


//*****************************************************************************
//
// Flash Memory Controller (FMC) registers
//
//*****************************************************************************

#define FMC_PFAPR                     (*((volatile uint32_t *)0x4001F000))      // Flash Access Protection Register
#define FMC_PFB01CR                   (*((volatile uint32_t *)0x4001F004))      // Flash Bank 0-1 Control Register
#define FMC_PFB23CR                   (*((volatile uint32_t *)0x4001F008))      // Flash Bank 2-3 Control Register
#define FMC_TAGVDW0S0                 (*((volatile uint32_t *)0x4001F100))      // Cache Tag Storage
#define FMC_TAGVDW0S1                 (*((volatile uint32_t *)0x4001F104))      // Cache Tag Storage
#define FMC_TAGVDW0S2                 (*((volatile uint32_t *)0x4001F108))      // Cache Tag Storage
#define FMC_TAGVDW0S3                 (*((volatile uint32_t *)0x4001F10C))      // Cache Tag Storage
#define FMC_TAGVDW1S0                 (*((volatile uint32_t *)0x4001F110))      // Cache Tag Storage
#define FMC_TAGVDW1S1                 (*((volatile uint32_t *)0x4001F114))      // Cache Tag Storage
#define FMC_TAGVDW1S2                 (*((volatile uint32_t *)0x4001F118))      // Cache Tag Storage
#define FMC_TAGVDW1S3                 (*((volatile uint32_t *)0x4001F11C))      // Cache Tag Storage
#define FMC_TAGVDW2S0                 (*((volatile uint32_t *)0x4001F120))      // Cache Tag Storage
#define FMC_TAGVDW2S1                 (*((volatile uint32_t *)0x4001F124))      // Cache Tag Storage
#define FMC_TAGVDW2S2                 (*((volatile uint32_t *)0x4001F128))      // Cache Tag Storage
#define FMC_TAGVDW2S3                 (*((volatile uint32_t *)0x4001F12C))      // Cache Tag Storage
#define FMC_TAGVDW3S0                 (*((volatile uint32_t *)0x4001F130))      // Cache Tag Storage
#define FMC_TAGVDW3S1                 (*((volatile uint32_t *)0x4001F134))      // Cache Tag Storage
#define FMC_TAGVDW3S2                 (*((volatile uint32_t *)0x4001F138))      // Cache Tag Storage
#define FMC_TAGVDW3S3                 (*((volatile uint32_t *)0x4001F13C))      // Cache Tag Storage
#define FMC_DATAW0S0UM                (*((volatile uint32_t *)0x4001F200))      // Cache Data Storage
#define FMC_DATAW0S0MU                (*((volatile uint32_t *)0x4001F204))      // Cache Data Storage
#define FMC_DATAW0S0ML                (*((volatile uint32_t *)0x4001F208))      // Cache Data Storage
#define FMC_DATAW0S0LM                (*((volatile uint32_t *)0x4001F20C))      // Cache Data Storage
#define FMC_DATAW0S1UM                (*((volatile uint32_t *)0x4001F210))      // Cache Data Storage


//*****************************************************************************
//
// NAND Flash Controller (NFC) registers
//
//*****************************************************************************

